diagrams/deposit_sequence_diagram_notify_l2.puml
@startuml
autoactivate on
actor "Bob :: User" as Bob
participant CasperWallet
box "l2-stack" #LightBlue
participant WebClient
participant ApiServer
participant Database
participant Prover
participant CasperNode
end box
box "on-chain" #LightGreen
participant VerifyDepositSession
participant ValidiumContract
end box

activate CasperNode
activate ApiServer

note over CasperNode, ApiServer
After the deploy gets processed we get notified
end note

CasperNode -> ApiServer: eventHandler(event :: DeployProcessed)
ApiServer -> CasperNode: query_balance()
CasperNode --> ApiServer: query_balance_result

ApiServer -> Database: insert_deposit(user: Bob, amount)
Database --> ApiServer: Ok

ApiServer --> WebClient: trigger_refresh
ApiServer --> ApiServer: end eventHandler

WebClient -> ApiServer: GET /balance/{user: Bob}
ApiServer -> Database: get_balance(user: Bob)
Database --> ApiServer: balance
ApiServer --> WebClient: balance
WebClient --> Bob: notify_with_signal

@enduml
